solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_ITRC.h
#define ITRC_STATUS1_IN20_STATUS_MASK            (0x10U)
#define ITRC_STATUS1_IN20_STATUS_SHIFT           (4U)
/*! IN20_STATUS - Error response of Shared APB slave group 0 and Shared peripheral AIPS2 occurred.
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN20_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN20_STATUS_SHIFT)) & ITRC_STATUS1_IN20_STATUS_MASK)

#define ITRC_STATUS1_IN21_STATUS_MASK            (0x20U)
#define ITRC_STATUS1_IN21_STATUS_SHIFT           (5U)
/*! IN21_STATUS - AHBSC0 bus checkers detected illegal access.
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN21_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN21_STATUS_SHIFT)) & ITRC_STATUS1_IN21_STATUS_MASK)

#define ITRC_STATUS1_IN22_STATUS_MASK            (0x40U)
#define ITRC_STATUS1_IN22_STATUS_SHIFT           (6U)
/*! IN22_STATUS - AHBSC3 bus checkers detected illegal access.
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN22_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN22_STATUS_SHIFT)) & ITRC_STATUS1_IN22_STATUS_MASK)

#define ITRC_STATUS1_IN23_STATUS_MASK            (0x80U)
#define ITRC_STATUS1_IN23_STATUS_SHIFT           (7U)
/*! IN23_STATUS - AHBSC4 bus checkers detected illegal access.
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN23_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN23_STATUS_SHIFT)) & ITRC_STATUS1_IN23_STATUS_MASK)

#define ITRC_STATUS1_IN24_STATUS_MASK            (0x100U)
#define ITRC_STATUS1_IN24_STATUS_SHIFT           (8U)
/*! IN24_STATUS - PKC module detected an error event.
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN24_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN24_STATUS_SHIFT)) & ITRC_STATUS1_IN24_STATUS_MASK)

#define ITRC_STATUS1_IN25_STATUS_MASK            (0x200U)
#define ITRC_STATUS1_IN25_STATUS_SHIFT           (9U)
/*! IN25_STATUS - ELS error event occurred.
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN25_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN25_STATUS_SHIFT)) & ITRC_STATUS1_IN25_STATUS_MASK)

#define ITRC_STATUS1_IN26_STATUS_MASK            (0x400U)
#define ITRC_STATUS1_IN26_STATUS_SHIFT           (10U)
/*! IN26_STATUS - Low frequency clock tamper output event occurred.
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN26_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN26_STATUS_SHIFT)) & ITRC_STATUS1_IN26_STATUS_MASK)

#define ITRC_STATUS1_IN28_STATUS_MASK            (0x1000U)
#define ITRC_STATUS1_IN28_STATUS_SHIFT           (12U)
/*! IN28_STATUS - SAFO-SGI error event occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN28_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN28_STATUS_SHIFT)) & ITRC_STATUS1_IN28_STATUS_MASK)

#define ITRC_STATUS1_IN29_STATUS_MASK            (0x2000U)
#define ITRC_STATUS1_IN29_STATUS_SHIFT           (13U)
/*! IN29_STATUS - TRNG HW error event occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN29_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN29_STATUS_SHIFT)) & ITRC_STATUS1_IN29_STATUS_MASK)

#define ITRC_STATUS1_IN30_STATUS_MASK            (0x4000U)
#define ITRC_STATUS1_IN30_STATUS_SHIFT           (14U)
/*! IN30_STATUS - PINT0 pin interrupt bit 0 occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN30_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN30_STATUS_SHIFT)) & ITRC_STATUS1_IN30_STATUS_MASK)

#define ITRC_STATUS1_IN31_STATUS_MASK            (0x8000U)
#define ITRC_STATUS1_IN31_STATUS_SHIFT           (15U)
/*! IN31_STATUS - PINT0 pin interrupt bit 1 occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN31_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN31_STATUS_SHIFT)) & ITRC_STATUS1_IN31_STATUS_MASK)

#define ITRC_STATUS1_IN32_STATUS_MASK            (0x10000U)
#define ITRC_STATUS1_IN32_STATUS_SHIFT           (16U)
/*! IN32_STATUS - PINT1 pin interrupt bit 0 occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN32_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN32_STATUS_SHIFT)) & ITRC_STATUS1_IN32_STATUS_MASK)

#define ITRC_STATUS1_IN33_STATUS_MASK            (0x20000U)
#define ITRC_STATUS1_IN33_STATUS_SHIFT           (17U)
/*! IN33_STATUS - PINT1 pin interrupt bit 1 occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN33_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN33_STATUS_SHIFT)) & ITRC_STATUS1_IN33_STATUS_MASK)

#define ITRC_STATUS1_IN34_STATUS_MASK            (0x40000U)
#define ITRC_STATUS1_IN34_STATUS_SHIFT           (18U)
/*! IN34_STATUS - Software event 0 occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN34_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN34_STATUS_SHIFT)) & ITRC_STATUS1_IN34_STATUS_MASK)

#define ITRC_STATUS1_IN35_STATUS_MASK            (0x80000U)
#define ITRC_STATUS1_IN35_STATUS_SHIFT           (19U)
/*! IN35_STATUS - Software event 1 occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN35_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN35_STATUS_SHIFT)) & ITRC_STATUS1_IN35_STATUS_MASK)

#define ITRC_STATUS1_IN36_STATUS_MASK            (0x100000U)
#define ITRC_STATUS1_IN36_STATUS_SHIFT           (20U)
/*! IN36_STATUS - XSPI0 GCM error occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN36_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN36_STATUS_SHIFT)) & ITRC_STATUS1_IN36_STATUS_MASK)

#define ITRC_STATUS1_IN37_STATUS_MASK            (0x200000U)
#define ITRC_STATUS1_IN37_STATUS_SHIFT           (21U)
/*! IN37_STATUS - GLIKEY error occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN37_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN37_STATUS_SHIFT)) & ITRC_STATUS1_IN37_STATUS_MASK)

#define ITRC_STATUS1_IN38_STATUS_MASK            (0x400000U)
#define ITRC_STATUS1_IN38_STATUS_SHIFT           (22U)
/*! IN38_STATUS - XSPI1 GCM error occurred
 *  0b0..Output not triggered.
 *  0b1..Output has been triggered.
 */
#define ITRC_STATUS1_IN38_STATUS(x)              (((uint32_t)(((uint32_t)(x)) << ITRC_STATUS1_IN38_STATUS_SHIFT)) & ITRC_STATUS1_IN38_STATUS_MASK)

